v2206/MSc_icedAirfoil/Meshing_ice_1_v2/+00deg/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver		GAMG;
        smoother        GaussSeidel;
        tolerance       1e-07;
        relTol          1e-05;
    }
    pFinal
    {
	$p;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          1e-05;
	nSweeps		1;
    }
    "(U|k|omega)Final"
    {
	$U;	
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors	0;
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         1;
}

SIMPLE
{
    nNonOrthogonalCorrectors	0;
    consistent		yes;
    pRefCell		0;
    pRefValue		0;

    residualControl
    {
        p		1e-5;
        U		1e-5;
        "(k|epsilon|omega)"	1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        "(U|k|omega)"	0.9;
        ".*"            0.9;
    }
}

// ************************************************************************* //
